base/Documents/бит_му_ОбесценениеОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_му_ОбесценениеОС</Name>
			<Comment>(БИТ МУ)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.бит_Дополнительный_4</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоБюджетам</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_3</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_1</xr:Item>
				<xr:Item>InformationRegister.бит_му_ПараметрыОС</xr:Item>
				<xr:Item>AccumulationRegister.бит_СоответствиеОборотовТрансляции</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоТипамПроводок</xr:Item>
				<xr:Item>AccountingRegister.бит_Бюджетирование</xr:Item>
				<xr:Item>InformationRegister.бит_му_СобытияОС</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_5</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_2</xr:Item>
				<xr:Item>InformationRegister.бит_СоответствиеЗаписейТрансляции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Вид операции</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_му_ВидыОперацийОбесценениеОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвижения</Name>
					<Comment>Вид движения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_му_ВидыДвиженияОбесценения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_ПодразделениеМСФО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МОЛ</Name>
					<Comment>МОЛ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, ответственный за заполнение данного документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Comment>Ручная корректировка (служебный реквизит)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтразитьВЗакрытомПериоде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОсновныеСредства</Name>
					<Comment>Основные средства</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Comment>Основное средство</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БалансоваяСтоимость</Name>
							<Comment>Балансовая стоимость</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозмещаемаяСтоимость</Name>
							<Comment>Возмещаемая стоимость</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Возмещаемая стоимость</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОбесценения</Name>
							<Comment>Причина обесценения</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_му_ПричиныОбесцененияВНА</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетСниженияСтоимости</Name>
							<Comment>Счет снижения стоимости</Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДоходовРасходов</Name>
							<Comment>Счет доходов/расходов от обесценения ОС</Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Comment>Субконто1</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Comment>Субконто1</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Comment>Субконто1</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто4</Name>
							<Comment>Субконто1</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

base/InformationRegisters/бит_му_СобытияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_му_СобытияОС</Name>
			<Comment>(БИТ МУ)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Comment>Основное средство</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Comment>Событие</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_му_СобытияОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/Enums/бит_му_ВидыДвиженияОбесценения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_му_ВидыДвиженияОбесценения</Name>
			<Comment>(БИТ МУ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФормированиеРезерва</Name>
					<Comment>Формирование резерва</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОбесценения</Name>
					<Comment>Возврат обесценения</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Enums/бит_му_СобытияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_му_СобытияОС</Name>
			<Comment>(БИТ МУ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринятиеКУчету</Name>
					<Comment>Принятие к учету</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеРезерва</Name>
					<Comment>Формирование резерва</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОбесценения</Name>
					<Comment>Возврат обесценения</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Модернизация</Name>
					<Comment>Модернизация</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дооценка</Name>
					<Comment>Дооценка ОС при переоценки</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уценка</Name>
					<Comment>Уценка ОС при переоценки</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеАмортизации</Name>
					<Comment>Начисление амортизации</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеПроцентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеклассификацияЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перевод</Name>
					<Comment>Перевод в предназначенные для продажи</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
					<Comment>Продажа</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выбытие</Name>
					<Comment>Выбытие</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводВСоставИнвестиционнойСобственности</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Enums/бит_му_СостоянияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_му_СостоянияОС</Name>
			<Comment>(БИТ МУ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринятоКУчету</Name>
					<Comment>Принято к учету</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятоСУчета</Name>
					<Comment>Снято с учета</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Documents/бит_му_ОбесценениеОС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки	 - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
	
	Настройки.ПриДобавленииКомандПечати = Истина;
		
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
	// Расчет амортизации.
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор				= "РасчетАмортизации";
	КомандаПечати.Представление				= НСтр("ru='Расчет амортизации';en='Depreciation Calculation'");
	КомандаПечати.Обработчик				= "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок					= 10;		
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РасчетАмортизации") Тогда					
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "РасчетАмортизации", 
			НСтр("ru='Расчет амортизации';en='Depreciation Calculation'"), 
			ПечатьРасчетаАмортизации(МассивОбъектов),,"Документ.бит_му_ОбесценениеОС.РасчетАмортизации");
	КонецЕсли;
	
	ОбщегоНазначенияБП.ЗаполнитьДополнительныеПараметрыПечати(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);	
	
КонецПроцедуры

// СтандартныеПодсистемы.Печать

// Функция подготавливает параметры проведения.
// 
// Параметры:
//  ДокументСсылка - ДокументСсылка.бит_НазначениеСоответствияАналитик - ссылка на документ.
//
// Возвращаемое значение:
//  Структура - структура параметров проведения.
//
Функция ПодготовитьПараметрыПроведения(ДокументСсылка) Экспорт
	
	ПараметрыПроведения = Новый Структура(); 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Реквизиты.Ссылка КАК Ссылка,
	               |	Реквизиты.Дата КАК Дата,
	               |	Реквизиты.Организация КАК Организация,
	               |	Реквизиты.ВидОперации КАК ВидОперации,
	               |	Реквизиты.ВидДвижения КАК ВидДвижения,
	               |	Реквизиты.Подразделение КАК Подразделение,
	               |	Реквизиты.МОЛ КАК МОЛ,
	               |	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	               |	Реквизиты.КурсДокумента КАК КурсДокумента,
	               |	Реквизиты.КратностьДокумента КАК КратностьДокумента,
	               |	Реквизиты.Ответственный КАК Ответственный,
	               |	Реквизиты.РучнаяКорректировка КАК РучнаяКорректировка,
	               |	Реквизиты.ОтразитьВЗакрытомПериоде КАК ОтразитьВЗакрытомПериоде,
	               |	Реквизиты.МоментВремени КАК МоментВремени
	               |ИЗ
	               |	Документ.бит_му_ОбесценениеОС КАК Реквизиты
	               |ГДЕ
	               |	Реквизиты.Ссылка = &Ссылка";
	Результат = Запрос.Выполнить().Выгрузить();
	Реквизиты = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Результат[0]);
		
	Запрос = Новый Запрос(); 
	Запрос.УстановитьПараметр("Ссылка",             ДокументСсылка);
	Запрос.УстановитьПараметр("Организация",        Реквизиты.Организация);
	Запрос.УстановитьПараметр("НачалоПериода",      НачалоМесяца(Реквизиты.Дата));
	Запрос.УстановитьПараметр("КонецПериода" ,      КонецМесяца(Реквизиты.Дата));
	Запрос.УстановитьПараметр("МоментВремени",      Реквизиты.МоментВремени);
	
	Если Реквизиты.ВидДвижения = Перечисления.бит_му_ВидыДвиженияОбесценения.ВозвратОбесценения Тогда
		Запрос.УстановитьПараметр("ЭтоВозвратОбесценения",Истина);
	Иначе	
		Запрос.УстановитьПараметр("ЭтоВозвратОбесценения",Ложь);
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапросаОсновныеСредства();

	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить();
	ТаблицаОС = Результат.Выгрузить();
	
	МассивОС = ТаблицаОС.ВыгрузитьКолонку("ОсновноеСредство");
	бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(МассивОС);
	
	ПараметрыПроведения = Новый Структура; 
	
	// Получим исторические курсы валют по каждому НМА.
	ВидыКурсов = Новый Структура("Упр,Регл,МУ,Документ");
	СтруктураКурсыВалют = бит_му_ОбщегоНазначения.КурсыВалютДокументаМУ(ДокументСсылка, Реквизиты.Дата, ВидыКурсов);
	ИсторическиеКурсы   = ИсторическиеКурсыВалют(Реквизиты, МассивОС, Реквизиты.Дата, СтруктураКурсыВалют);
	
	Для каждого СтрокаТаблица Из ТаблицаОС Цикл 
		СтрокаТаблица.ЛиквидационнаяСтоимость = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(СтрокаТаблица.ЛиквидационнаяСтоимость,
			ИсторическиеКурсы[СтрокаТаблица.ОсновноеСредство].Му, ИсторическиеКурсы[СтрокаТаблица.ОсновноеСредство].Документ); 
	КонецЦикла;   
	
	ПараметрыПроведения.Вставить("Реквизиты", Реквизиты);
	ПараметрыПроведения.Вставить("ИсторическиеКурсы", ИсторическиеКурсы);
	
	Если Реквизиты.ВидДвижения = Перечисления.бит_му_ВидыДвиженияОбесценения.ВозвратОбесценения Тогда
		ДеревоРезультат = бит_му_ВНА.РасчетМоделированиеАмортизации(Реквизиты,ТаблицаОС);
		ПараметрыПроведения.Вставить("РасчетАмортизации", ДеревоРезультат);
	КонецЕсли; 
	
	ПараметрыПроведения.Вставить("ОсновныеСредства", ТаблицаОС);
	
	// Получим параметры классов ВНА
	ПараметрыКлассов = Новый Соответствие;
	МассивКлассов    = ТаблицаОС.ВыгрузитьКолонку("Класс");
	бит_РаботаСКоллекциями.УдалитьПовторяющиесяЭлементыМассива(МассивКлассов);
	
	Для каждого Класс Из МассивКлассов Цикл
		СтруктураПараметров = Новый Структура("Организация,Класс", Реквизиты.Организация, Класс);
		ПараметрыКлассов.Вставить(Класс,бит_му_ВНА.ПолучитьПараметрыКлассаВНА(СтруктураПараметров));
	КонецЦикла; 
	
	ПараметрыПроведения.Вставить("ПараметрыКлассов", ПараметрыКлассов);	
	
	Возврат ПараметрыПроведения;
	
КонецФункции 

// Формирует движения по регистру бухгалтерии: Журнал проводок (международный).
//
// Параметры:
//  ПараметрыПроведения	- Структура.
//  Движения		    - КоллекцияДвижений - Ссылка на движения документа.
//
Процедура СформироватьДвиженияМеждународныйУчет(ПараметрыПроведения, Движения) Экспорт

	ТаблицаОсновныеСредства = ПараметрыПроведения.ОсновныеСредства;
	Реквизиты               = ПараметрыПроведения.Реквизиты;
	СтруктураКурсыВалют     = ПараметрыПроведения.ИсторическиеКурсы;
	
	Для каждого СтрокаТаблицы Из ТаблицаОсновныеСредства Цикл
		
		Если СтрокаТаблицы.Сумма = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		Запись = Движения.бит_Дополнительный_2.Добавить();
		
		Если Реквизиты.ВидДвижения = Перечисления.бит_му_ВидыДвиженияОбесценения.ВозвратОбесценения Тогда
			
			 ДтКтРасходы  = "Кт";
			 ДтКтСнижение = "Дт";
			 Содержание   = НСтр("ru = 'возврат обесценения'; en = 'impairment recovery'");
			
		Иначе 
			 // Формирование резерва
			 ДтКтРасходы  = "Дт";
			 ДтКтСнижение = "Кт";
			 Содержание   = НСтр("ru = 'формирование резерва'; en = 'reserve formation'");

		КонецЕсли; 
		
		КурсыВалют = СтруктураКурсыВалют[СтрокаТаблицы.ОсновноеСредство];
		
		// Заполнение атрибутов записи	
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", Реквизиты.Организация);
		СтруктураПараметров.Вставить("Период",      Реквизиты.Дата);
		СтруктураПараметров.Вставить("Валюта",      КурсыВалют.Документ.Валюта);
		СтруктураПараметров.Вставить("СчетДт",      "");
		СтруктураПараметров.Вставить("СчетКт",      "");
		СтруктураПараметров.Вставить("Сумма",       СтрокаТаблицы.Сумма);
		СтруктураПараметров.Вставить("Содержание",  Содержание);
												   	
		СтруктураПараметров["Счет"+ДтКтСнижение] = СтрокаТаблицы.СчетСниженияСтоимости;
		СтруктураПараметров["Счет"+ДтКтРасходы]  = СтрокаТаблицы.СчетДоходовРасходов;
											   
		бит_му_ОбщегоНазначения.ЗаполнитьЗаписьРегистраМУ(Запись,СтруктураПараметров);											   
		
		// Заполнение аналитики	
		Для НомерСубконто = 1 По 4 Цикл
			
			бит_му_ОбщегоНазначения.УстановитьСубконто(Запись["Счет"+ДтКтРасходы]
			                                            ,Запись["Субконто"+ДтКтРасходы]
														,НомерСубконто
														,СтрокаТаблицы["Субконто"+НомерСубконто]);			
			
		КонецЦикла; 
		
		бит_му_ОбщегоНазначения.УстановитьСубконто(Запись["Счет"+ДтКтСнижение], 
			Запись["Субконто"+ДтКтСнижение], "ОсновныеСредства", СтрокаТаблицы.ОсновноеСредство);		
		
		бит_му_ОбщегоНазначения.УстановитьСубконто(Запись["Счет"+ДтКтСнижение], 
			Запись["Субконто"+ДтКтСнижение], "ЦФО", СтрокаТаблицы.ЦФО);
			
		// Выполнение валютных пересчетов	
		МассивИмен = Новый Массив;
		МассивИмен.Добавить("Сумма");
		бит_КурсыВалют.ВыполнитьВалютныеПересчеты(СтруктураПараметров
														,Запись
														,МассивИмен
														,КурсыВалют
														,КурсыВалют.Документ);
														
	КонецЦикла;
	
	Движения.бит_Дополнительный_2.Записывать = Истина;
	
КонецПроцедуры

// Формирует движения по регистру сведений: Параметры ОС (МСФО).
//
// Параметры:
//  ПараметрыПроведения	- Структура.
//  Движения		    - КоллекцияДвижений - Ссылка на движения документа.
//
Процедура СформироватьДвиженияПараметрыОС(ПараметрыПроведения, Движения) Экспорт
	
	ТаблицаОсновныеСредства = ПараметрыПроведения.ОсновныеСредства;
	Реквизиты               = ПараметрыПроведения.Реквизиты;
		
	Для каждого СтрокаТаблицы Из ТаблицаОсновныеСредства Цикл 
		
		Если СтрокаТаблицы.ВозмещаемаяСтоимость = 0 Тогда
			НачислятьАмортизацию = Ложь;
		ИначеЕсли СтрокаТаблицы.ВозмещаемаяСтоимость > 0 
			И СтрокаТаблицы.БалансоваяСтоимость = 0 Тогда 
			НачислятьАмортизацию = Истина; 
		Иначе
			Продолжить;
		КонецЕсли;   
		
		Запись = Движения.бит_му_ПараметрыОС.Добавить();
		Запись.Период            = Реквизиты.Дата;
		Запись.Организация       = Реквизиты.Организация;
		Запись.ОсновноеСредство  = СтрокаТаблицы.ОсновноеСредство;
		Запись.Параметр          = ПланыВидовХарактеристик.бит_му_ВидыПараметровВНА.НачислятьАмортизацию_ОС;
		Запись.ЗначениеПараметра = НачислятьАмортизацию;
	КонецЦикла;
	
	Движения.бит_му_ПараметрыОС.Записывать = Истина;

КонецПроцедуры

// Формирует движения по регистру сведений: События ОС (МСФО).
//
// Параметры:
//  ПараметрыПроведения	- Структура.
//  Движения		    - КоллекцияДвижений - Ссылка на движения документа.
//
Процедура СформироватьДвиженияСобытияОС(ПараметрыПроведения, Движения) Экспорт
	
	ТаблицаОсновныеСредства = ПараметрыПроведения.ОсновныеСредства;
	Реквизиты               = ПараметрыПроведения.Реквизиты;
	
	Если Реквизиты.ВидДвижения = Перечисления.бит_му_ВидыДвиженияОбесценения.ВозвратОбесценения Тогда
		Событие = Перечисления.бит_му_СобытияОС.ВозвратОбесценения;
	Иначе
		Событие = Перечисления.бит_му_СобытияОС.ФормированиеРезерва;
	КонецЕсли;
	
	Для каждого СтрокаТаблицы Из ТаблицаОсновныеСредства Цикл
		Запись = Движения.бит_му_СобытияОС.Добавить();
		Запись.Период           = Реквизиты.Дата;
		Запись.Организация      = Реквизиты.Организация;
		Запись.ОсновноеСредство = СтрокаТаблицы.ОсновноеСредство;
		Запись.Событие          = Событие;
	КонецЦикла;
	
	Движения.бит_му_СобытияОС.Записывать = Истина;

КонецПроцедуры

// Функция подготавливает таблицу дат принятия ОС.
// 
// Параметры:
//  Организация - СправочникСсылка.Организации.
//  МассивОС    - Массив
// 
// Возвращаемое значение:
//  ТаблицаЗначения
// 
Функция ПодготовитьТаблицуДатПринятияОС(Организация, МассивОС) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("СостояниеПринято", Перечисления.бит_му_СостоянияОС.ПринятоКУчету);
	Запрос.УстановитьПараметр("МассивОС", МассивОС);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СостоянияОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СостоянияОС.ДатаСостояния КАК Период
	|ИЗ
	|	РегистрСведений.бит_му_СостоянияОС КАК СостоянияОС
	|ГДЕ
	|	СостоянияОС.ОсновноеСредство В(&МассивОС)
	|	И СостоянияОС.Состояние = &СостояниеПринято
	|	И СостоянияОС.Организация = &Организация";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
		
КонецФункции

// Функция получает параметры ОС для массива ОС или одного основного средства.
// 
// Параметры:
//  Реквизиты 		 - Структура.
//  ПереченьОбъектов - Массив.
// 
// Возвращаемое значение:
//  Соответствие.
// 
Функция ПолучитьПараметры(Реквизиты, ПереченьОбъектов) Экспорт
		
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Организация", Реквизиты.Организация);
	СтруктураПараметров.Вставить("Дата", 		Реквизиты.Дата);
	СтруктураПараметров.Вставить("ЭтоНовый", 	Реквизиты.ЭтоНовыйДокумент); 
	
	Граница = Новый Граница(КонецМесяца(Реквизиты.Дата), ВидГраницы.Включая);
	СтруктураПараметров.Вставить("МоментВремени", Граница);
	СтруктураПараметров.Вставить("ВидДвижения",   Реквизиты.ВидДвижения);
	
	СтрПараметры = бит_му_ВНА.ПолучитьПараметрыДляОбесцененияВНА(ПереченьОбъектов, СтруктураПараметров);
	
	Возврат СтрПараметры;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаОсновныеСредства()
		
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка КАК Ссылка,
	|	ОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ОсновныеСредства.БалансоваяСтоимость КАК БалансоваяСтоимость,
	|	ОсновныеСредства.ВозмещаемаяСтоимость КАК ВозмещаемаяСтоимость,
	|	ОсновныеСредства.Сумма КАК Сумма,
	|	ОсновныеСредства.ПричинаОбесценения КАК ПричинаОбесценения,
	|	ОсновныеСредства.СчетСниженияСтоимости КАК СчетСниженияСтоимости,
	|	ОсновныеСредства.СчетДоходовРасходов КАК СчетДоходовРасходов,
	|	ОсновныеСредства.Субконто1 КАК Субконто1,
	|	ОсновныеСредства.Субконто2 КАК Субконто2,
	|	ОсновныеСредства.Субконто3 КАК Субконто3,
	|	ОсновныеСредства.Субконто4 КАК Субконто4
	|ПОМЕСТИТЬ ОсновныеСредства
	|ИЗ
	|	Документ.бит_му_ОбесценениеОС.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА бит_му_ПараметрыОССрезПоследних.Параметр = ЗНАЧЕНИЕ(ПланВидовХарактеристик.бит_му_ВидыПараметровВНА.ЛиквидационнаяСтоимость_ОС)
	|				ТОГДА бит_му_ПараметрыОССрезПоследних.ЗначениеПараметра
	|			ИНАЧЕ NULL
	|		КОНЕЦ) КАК ЛиквидационнаяСтоимость,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА бит_му_ПараметрыОССрезПоследних.Параметр = ЗНАЧЕНИЕ(ПланВидовХарактеристик.бит_му_ВидыПараметровВНА.Класс_ОС)
	|				ТОГДА бит_му_ПараметрыОССрезПоследних.ЗначениеПараметра
	|			ИНАЧЕ NULL
	|		КОНЕЦ) КАК Класс,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА бит_му_ПараметрыОССрезПоследних.Параметр = ЗНАЧЕНИЕ(ПланВидовХарактеристик.бит_му_ВидыПараметровВНА.ЦФО_ОС)
	|				ТОГДА бит_му_ПараметрыОССрезПоследних.ЗначениеПараметра
	|			ИНАЧЕ NULL
	|		КОНЕЦ) КАК ЦФО,
	|	бит_му_ПараметрыОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство
	|ПОМЕСТИТЬ ТаблицаПараметров
	|ИЗ
	|	РегистрСведений.бит_му_ПараметрыОС.СрезПоследних(
	|			&МоментВремени,
	|			ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство
	|					ИЗ
	|						ОсновныеСредства КАК ОсновныеСредства)
	|				И Организация = &Организация) КАК бит_му_ПараметрыОССрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_му_ПараметрыОССрезПоследних.ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ДатыМодернизации.ОсновноеСредство, ДатыФормированияРезерва.ОсновноеСредство) КАК ОсновноеСредство,
	|	ЕСТЬNULL(ДатыМодернизации.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК ПериодМодернизации,
	|	МИНИМУМ(ЕСТЬNULL(ДатыФормированияРезерва.Период, ДАТАВРЕМЯ(1, 1, 1))) КАК ПериодФормированияРезерва
	|ПОМЕСТИТЬ ПериодыМодернизации
	|ИЗ
	|	РегистрСведений.бит_му_СобытияОС.СрезПоследних(
	|			&МоментВремени,
	|			&ЭтоВозвратОбесценения = ИСТИНА
	|				И Организация = &Организация
	|				И Событие = ЗНАЧЕНИЕ(Перечисление.бит_му_СобытияОС.Модернизация)
	|				И ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство
	|					ИЗ
	|						ОсновныеСредства КАК ОсновныеСредства)) КАК ДатыМодернизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_му_СобытияОС КАК ДатыФормированияРезерва
	|		ПО ДатыМодернизации.Организация = ДатыФормированияРезерва.Организация
	|			И ДатыМодернизации.ОсновноеСредство = ДатыФормированияРезерва.ОсновноеСредство
	|			И ДатыМодернизации.Период < ДатыФормированияРезерва.Период
	|			И (ДатыФормированияРезерва.Событие = ЗНАЧЕНИЕ(Перечисление.бит_му_СобытияОС.ФормированиеРезерва))
	|			И (ДатыФормированияРезерва.ОсновноеСредство В
	|				(ВЫБРАТЬ
	|					ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство
	|				ИЗ
	|					ОсновныеСредства КАК ОсновныеСредства))
	|			И (ДатыФормированияРезерва.Организация = &Организация)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ДатыМодернизации.ОсновноеСредство, ДатыФормированияРезерва.ОсновноеСредство),
	|	ЕСТЬNULL(ДатыМодернизации.Период, ДАТАВРЕМЯ(1, 1, 1))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СобытияОС.ОсновноеСредство КАК ОсновноеСредство
	|ПОМЕСТИТЬ НачисленаАмортизацияТекущий
	|ИЗ
	|	РегистрСведений.бит_му_СобытияОС КАК СобытияОС
	|ГДЕ
	|	СобытияОС.Организация = &Организация
	|	И СобытияОС.Событие = ЗНАЧЕНИЕ(Перечисление.бит_му_СобытияОс.НачислениеАмортизации)
	|	И СобытияОС.ОсновноеСредство В
	|			(ВЫБРАТЬ
	|				ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство
	|			ИЗ
	|				ОсновныеСредства КАК ОсновныеСредства)
	|	И СобытияОС.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бит_му_СобытияОС.ОсновноеСредство КАК ОсновноеСредство
	|ПОМЕСТИТЬ НачисленаАмортизацияСледующий
	|ИЗ
	|	РегистрСведений.бит_му_СобытияОС КАК бит_му_СобытияОС
	|ГДЕ
	|	бит_му_СобытияОС.Организация = &Организация
	|	И бит_му_СобытияОС.Событие = ЗНАЧЕНИЕ(Перечисление.бит_му_СобытияОс.НачислениеАмортизации)
	|	И бит_му_СобытияОС.ОсновноеСредство В
	|			(ВЫБРАТЬ
	|				ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство
	|			ИЗ
	|				ОсновныеСредства КАК ОсновныеСредства)
	|	И бит_му_СобытияОС.Период >= ДОБАВИТЬКДАТЕ(&НачалоПериода, МЕСЯЦ, 1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабЧасть.НомерСтроки КАК НомерСтроки,
	|	ТабЧасть.ОсновноеСредство КАК ОсновноеСредство,
	|	ТабЧасть.ВозмещаемаяСтоимость КАК ВозмещаемаяСтоимость,
	|	ТабЧасть.Сумма КАК Сумма,
	|	ТабЧасть.СчетСниженияСтоимости КАК СчетСниженияСтоимости,
	|	ТабЧасть.СчетДоходовРасходов КАК СчетДоходовРасходов,
	|	ТабЧасть.Субконто1 КАК Субконто1,
	|	ТабЧасть.Субконто2 КАК Субконто2,
	|	ТабЧасть.Субконто3 КАК Субконто3,
	|	ТабЧасть.Субконто4 КАК Субконто4,
	|	ЕСТЬNULL(ТаблицаПараметров.ЛиквидационнаяСтоимость, 0) КАК ЛиквидационнаяСтоимость,
	|	ТаблицаПараметров.Класс.ВидКласса КАК ВидКласса,
	|	ТаблицаПараметров.Класс КАК Класс,
	|	Принятые.ДатаСостояния КАК ДатаПринятия,
	|	Выбывшие.ДатаСостояния КАК ДатаВыбытия,
	|	ЕСТЬNULL(СобытияОССрезПервых.Период, ДАТАВРЕМЯ(3999, 1, 1)) КАК ДатаФормированияРезерва,
	|	ЕСТЬNULL(ПериодыМодернизации.ПериодМодернизации, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаМодернизации,
	|	ЕСТЬNULL(ПериодыМодернизации.ПериодФормированияРезерва, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаФормированияРезерваПослеМодернизации,
	//++ ЕРП
	//|	ПервоначальныеСведенияОСБухгалтерскийУчетСрезПоследних.ИнвентарныйНомер,
	|	ТабЧасть.ОсновноеСредство.ИнвентарныйНомер,
	//-- ЕРП
	|	0 КАК СуммаАмортизации,
	|	0 КАК БалансоваяСтоимостьНач,
	|	ВЫБОР
	|		КОГДА НЕ НачисленаАмортизацияТекущий.ОсновноеСредство ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НачисленаТекущий,
	|	ВЫБОР
	|		КОГДА НЕ НачисленаАмортизацияСледующий.ОсновноеСредство ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НачисленаСледующий,
	|	ТабЧасть.БалансоваяСтоимость КАК БалансоваяСтоимость,
	|	ТаблицаПараметров.ЦФО КАК ЦФО
	|ИЗ
	|	ОсновныеСредства КАК ТабЧасть
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПараметров КАК ТаблицаПараметров
	|		ПО ТабЧасть.ОсновноеСредство = ТаблицаПараметров.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_му_СостоянияОС КАК Принятые
	|		ПО ТабЧасть.ОсновноеСредство = Принятые.ОсновноеСредство
	|			И (Принятые.Организация = &Организация)
	|			И (Принятые.Состояние = ЗНАЧЕНИЕ(Перечисление.бит_му_СостоянияОС.ПринятоКУчету))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_му_СостоянияОС КАК Выбывшие
	|		ПО ТабЧасть.ОсновноеСредство = Выбывшие.ОсновноеСредство
	|			И (Выбывшие.Организация = &Организация)
	|			И (Выбывшие.Состояние = ЗНАЧЕНИЕ(Перечисление.бит_му_СостоянияОС.СнятоСУчета))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_му_СобытияОС.СрезПервых(
	|				,
	|				&ЭтоВозвратОбесценения = ИСТИНА
	|					И Организация = &Организация
	|					И ОсновноеСредство В
	|						(ВЫБРАТЬ
	|							ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство
	|						ИЗ
	|							ОсновныеСредства КАК ОсновныеСредства)
	|					И Событие = ЗНАЧЕНИЕ(Перечисление.бит_му_СобытияОС.ФормированиеРезерва)) КАК СобытияОССрезПервых
	|		ПО ТабЧасть.ОсновноеСредство = СобытияОССрезПервых.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодыМодернизации КАК ПериодыМодернизации
	|		ПО ТабЧасть.ОсновноеСредство = ПериодыМодернизации.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ НачисленаАмортизацияСледующий КАК НачисленаАмортизацияСледующий
	|		ПО ТабЧасть.ОсновноеСредство = НачисленаАмортизацияСледующий.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ НачисленаАмортизацияТекущий КАК НачисленаАмортизацияТекущий
	|		ПО ТабЧасть.ОсновноеСредство = НачисленаАмортизацияТекущий.ОсновноеСредство
	|ГДЕ
	|	ТабЧасть.Ссылка = &Ссылка";
				   	
	Возврат ТекстЗапроса;
	
КонецФункции

// Функция формирует табличный документ для печати расчета-моделирования амортизации.
// 
// Возвращаемое значение:
//   ТабДокумент   - Табличный документ.
// 
Функция ПечатьРасчетаАмортизации(МассивСсылок)
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	Если МассивСсылок.Количество() = 0 Тогда
		Возврат ТабДокумент;
	КонецЕсли;
	
	ДокСсылка = МассивСсылок[0];
	Макет = ПолучитьМакет("РасчетАмортизации");
	
	// Получим данные для вывода.  
	ПараметрыПроведения = Документы.бит_му_ОбесценениеОС.ПодготовитьПараметрыПроведения(ДокСсылка);
	
	Реквизиты = ПараметрыПроведения.Реквизиты;
	ТаблицаОС = ПараметрыПроведения.ОсновныеСредства;
	
	Если Реквизиты.ВидДвижения <> Перечисления.бит_му_ВидыДвиженияОбесценения.ВозвратОбесценения  Тогда
		Возврат ТабДокумент;
	КонецЕсли;
	
	ДеревоРезультат = бит_му_ВНА.РасчетМоделированиеАмортизации(Реквизиты, ТаблицаОС);
	
	ОблМакета = Макет.ПолучитьОбласть("Заголовок");
	
	ТекстЗаголовка = НСтр("ru='Расчет амортизации для контроля обесценения ОС №%1 от %2 г.';
	                      |en='Calculating depreciation to control impairment of PP&E №%1 dated %2.'");
	ТекстЗаголовка = СтрШаблон(ТекстЗаголовка,
	                           ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДокСсылка.Номер, Истина, Истина),
							   Формат(Реквизиты.Дата, "ДФ='дд ММММ гггг'"));
	ОблМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	
	ТабДокумент.Вывести(ОблМакета);
	
	ОблМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДокумент.Вывести(ОблМакета);
	
	ОблМакета    = Макет.ПолучитьОбласть("Строка");
	ОблМакетаНиз = Макет.ПолучитьОбласть("СтрокаНиз");
	
	ТабДокумент.НачатьАвтогруппировкуСтрок();
	
	Ном = 1;
	Для каждого СтрокаДереваВерх Из ДеревоРезультат.Строки Цикл
		
		ОблМакета.Параметры.ОсновноеСредство    = СтрокаДереваВерх.ОбъектВНА;
		ОблМакета.Параметры.КонтрольнаяСумма    = бит_ОбщегоНазначения.ФорматСумм(СтрокаДереваВерх.БалансоваяСтоимость-СтрокаДереваВерх.СуммаАмортизации);
		ОблМакета.Параметры.БалансоваяСтоимость = бит_ОбщегоНазначения.ФорматСумм(СтрокаДереваВерх.БалансоваяСтоимость);
		ОблМакета.Параметры.СуммаАмортизации    = бит_ОбщегоНазначения.ФорматСумм(СтрокаДереваВерх.СуммаАмортизации);
		ОблМакета.Параметры.НомерСтроки         = Ном;
		ОблМакета.Параметры.ИнвентарныйНомер    = СтрокаДереваВерх.ИнвентарныйНомер;
		ТабДокумент.Вывести(ОблМакета,0);
		
		Для каждого СтрокаДереваНиз Из СтрокаДереваВерх.Строки Цикл
			
			ОблМакетаНиз.Параметры.Период = Формат(СтрокаДереваНиз.Период,"ДФ=dd.MM.yyyy"); 
			ОблМакетаНиз.Параметры.СуммаАмортизации = бит_ОбщегоНазначения.ФорматСумм(СтрокаДереваНиз.СуммаАмортизации);
			ТабДокумент.Вывести(ОблМакетаНиз,1);
			
		КонецЦикла;// По нижним строкам 
		
		Ном = Ном+1;
	КонецЦикла;// По верхним строкам
	
	ТабДокумент.ЗакончитьАвтогруппировкуСтрок();
	
	ОблМакета = Макет.ПолучитьОбласть("Итого");
	ТабДокумент.Вывести(ОблМакета);
	
	ТабДокумент.ПоказатьУровеньГруппировокСтрок(0);
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ИсторическиеКурсыВалют(Реквизиты, МассивОС, Период, СтруктураКурсыВалют)
	
	ИсторическиеКурсы = бит_му_ВНА.ИсторическиеКурсыВалют(Реквизиты, МассивОС, Период, СтруктураКурсыВалют);	
	
	// Получим дату принятия к учету для каждого ОС.
	ТаблицаДатПринятияОС = Документы.бит_му_ОбесценениеОС.ПодготовитьТаблицуДатПринятияОС(Реквизиты.Организация, МассивОС);
	
	ТаблицаПериодов = ТаблицаДатПринятияОС.Скопировать();
	ТаблицаПериодов.Свернуть("Период");
	СтруктураКурсыВалютДокумент = Новый Структура;
	СтруктураКурсыВалютДокумент.Вставить("Документ", СтруктураКурсыВалют.Документ); 
	
	// Получим курсы валюты документа для каждого ОС на дату принятия к учету.
	Курсы = бит_КурсыВалют.ПолучитьКурсыВалютПоПериодам(ТаблицаПериодов, СтруктураКурсыВалютДокумент);

	СоответствиеКурсовИОС = Новый Соответствие;
	 
	Для каждого Строка Из ТаблицаДатПринятияОС Цикл
		СоответствиеКурсовИОС.Вставить(Строка.ОсновноеСредство, Курсы[Строка.Период])
	КонецЦикла; 
	
	Для Каждого ТекОС Из ИсторическиеКурсы Цикл
		Если НЕ СоответствиеКурсовИОС[ТекОС.Ключ] = Неопределено Тогда
			ТекОС.Значение.Документ = СоответствиеКурсовИОС[ТекОС.Ключ].Документ;
		КонецЕсли; 
	КонецЦикла;
	
	Возврат ИсторическиеКурсы;
	
КонецФункции

#КонецОбласти

#КонецЕсли
